Data/Section 5/5.1/Clients/VM1_Intance1/rep1/output_C2_T1_W64_K6_R1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       43005 ops,     467 (avg:     477) ops/sec, 1.66MB/sec (avg: 1.70MB/sec),  4.27 (avg:  4.17) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         238.92          ---          ---      3.96500       248.11
Gets         238.91      1433.46         0.00      4.37500      1491.48
Waits          0.00          ---          ---      0.00000          ---
Totals       477.83      1433.46         0.00      4.17000      1739.60


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.300         0.02
SET       1.400         0.07
SET       1.500         0.44
SET       1.600         1.62
SET       1.700         3.92
SET       1.800         7.62
SET       1.900        12.16
SET       2.000        16.98
SET       2.100        22.22
SET       2.200        27.08
SET       2.300        31.24
SET       2.400        35.02
SET       2.500        38.29
SET       2.600        41.16
SET       2.700        43.49
SET       2.800        45.65
SET       2.900        47.44
SET       3.000        49.06
SET       3.100        50.64
SET       3.200        51.89
SET       3.300        53.09
SET       3.400        54.19
SET       3.500        55.36
SET       3.600        56.30
SET       3.700        57.44
SET       3.800        58.46
SET       3.900        59.50
SET       4.000        60.59
SET       4.100        61.75
SET       4.200        62.86
SET       4.300        64.01
SET       4.400        65.25
SET       4.500        66.43
SET       4.600        67.63
SET       4.700        68.88
SET       4.800        70.19
SET       4.900        71.53
SET       5.000        72.78
SET       5.100        74.14
SET       5.200        75.55
SET       5.300        76.82
SET       5.400        78.10
SET       5.500        79.49
SET       5.600        80.66
SET       5.700        81.85
SET       5.800        83.11
SET       5.900        84.15
SET       6.000        85.17
SET       6.100        86.26
SET       6.200        87.29
SET       6.300        88.24
SET       6.400        88.96
SET       6.500        89.64
SET       6.600        90.32
SET       6.700        90.92
SET       6.800        91.35
SET       6.900        91.78
SET       7.000        92.22
SET       7.100        92.60
SET       7.200        93.01
SET       7.300        93.33
SET       7.400        93.59
SET       7.500        93.83
SET       7.600        94.10
SET       7.700        94.38
SET       7.800        94.62
SET       7.900        94.85
SET       8.000        95.07
SET       8.100        95.31
SET       8.200        95.52
SET       8.300        95.69
SET       8.400        95.80
SET       8.500        95.92
SET       8.600        96.11
SET       8.700        96.25
SET       8.800        96.38
SET       8.900        96.55
SET       9.000        96.67
SET       9.100        96.80
SET       9.200        96.94
SET       9.300        97.09
SET       9.400        97.28
SET       9.500        97.44
SET       9.600        97.56
SET       9.700        97.69
SET       9.800        97.82
SET       9.900        97.94
SET      10.000        98.39
SET      11.000        98.85
SET      12.000        99.01
SET      13.000        99.14
SET      14.000        99.28
SET      15.000        99.43
SET      16.000        99.55
SET      17.000        99.67
SET      18.000        99.73
SET      19.000        99.78
SET      20.000        99.83
SET      21.000        99.86
SET      22.000        99.87
SET      23.000        99.90
SET      24.000        99.91
SET      25.000        99.93
SET      26.000        99.93
SET      27.000        99.93
SET      28.000        99.94
SET      29.000        99.95
SET      31.000        99.96
SET      34.000        99.96
SET      36.000        99.97
SET      38.000        99.97
SET      39.000        99.98
SET      47.000        99.98
SET      55.000        99.99
SET      59.000        99.99
SET      81.000       100.00
SET      88.000       100.00
---
GET       1.700         0.03
GET       1.800         0.30
GET       1.900         1.30
GET       2.000         3.43
GET       2.100         6.76
GET       2.200        10.96
GET       2.300        16.11
GET       2.400        21.08
GET       2.500        26.03
GET       2.600        30.50
GET       2.700        34.33
GET       2.800        37.80
GET       2.900        40.65
GET       3.000        43.16
GET       3.100        45.27
GET       3.200        47.12
GET       3.300        48.75
GET       3.400        50.20
GET       3.500        51.62
GET       3.600        52.82
GET       3.700        53.88
GET       3.800        54.87
GET       3.900        55.91
GET       4.000        56.81
GET       4.100        57.64
GET       4.200        58.44
GET       4.300        59.27
GET       4.400        60.19
GET       4.500        61.05
GET       4.600        61.89
GET       4.700        62.95
GET       4.800        63.90
GET       4.900        65.06
GET       5.000        66.23
GET       5.100        67.38
GET       5.200        68.63
GET       5.300        70.01
GET       5.400        71.25
GET       5.500        72.62
GET       5.600        73.87
GET       5.700        75.23
GET       5.800        76.71
GET       5.900        78.10
GET       6.000        79.55
GET       6.100        80.83
GET       6.200        82.20
GET       6.300        83.48
GET       6.400        84.75
GET       6.500        85.96
GET       6.600        86.82
GET       6.700        87.59
GET       6.800        88.42
GET       6.900        89.16
GET       7.000        89.87
GET       7.100        90.43
GET       7.200        91.03
GET       7.300        91.56
GET       7.400        91.95
GET       7.500        92.32
GET       7.600        92.70
GET       7.700        92.99
GET       7.800        93.41
GET       7.900        93.72
GET       8.000        93.94
GET       8.100        94.27
GET       8.200        94.54
GET       8.300        94.76
GET       8.400        94.96
GET       8.500        95.13
GET       8.600        95.28
GET       8.700        95.42
GET       8.800        95.61
GET       8.900        95.80
GET       9.000        95.98
GET       9.100        96.13
GET       9.200        96.26
GET       9.300        96.38
GET       9.400        96.50
GET       9.500        96.60
GET       9.600        96.74
GET       9.700        96.85
GET       9.800        96.97
GET       9.900        97.07
GET      10.000        97.67
GET      11.000        98.44
GET      12.000        98.81
GET      13.000        99.02
GET      14.000        99.17
GET      15.000        99.33
GET      16.000        99.47
GET      17.000        99.64
GET      18.000        99.69
GET      19.000        99.74
GET      20.000        99.78
GET      21.000        99.83
GET      22.000        99.85
GET      23.000        99.86
GET      24.000        99.87
GET      25.000        99.87
GET      26.000        99.89
GET      27.000        99.89
GET      28.000        99.91
GET      29.000        99.92
GET      30.000        99.93
GET      31.000        99.93
GET      32.000        99.94
GET      36.000        99.95
GET      46.000        99.96
GET      50.000        99.96
GET      51.000        99.97
GET      59.000        99.97
GET      60.000        99.98
GET      71.000        99.99
GET      73.000        99.99
GET      76.000       100.00
---